[
  {
    "id": "apps",
    "title": "IlliniSpots & IlliniPlan.com: Two Apps for Students",
    "date": "2025-01-20",
    "tags": ["Apps"],
    "summary": "I build two apps for UIUC students. IlliniSpots is a platform for users to find, rate, and review study spots on campus. IlliniPlan is a platform for users to plan their classes and schedule.",
    "content": "content/posts/apps.md",
    "type": "md"
  },
  {
    "id": "ml130824",
    "title": "Optimizing Natural Language Processing Systems: Advanced RAG and Intent Classification",
    "date": "2024-08-13",
    "tags":   ,
    "summary": "This paper presents cutting-edge techniques for enhancing Natural Language Processing (NLP) systems, focusing on two critical areas: Retrieval-Augmented Generation (RAG) and intent classification. We introduce a novel \"wavular\" RAG approach that significantly improves retrieval efficiency, and a hybrid embedding-based classification system optimized for limited datasets. Our methods demonstrate substantial improvements in computational efficiency and classification accuracy, addressing key challenges in modern NLP applications. This research is particularly relevant for scenarios with constrained computational resources or limited training data, offering innovative solutions to enhance NLP system performance across various domains. Keywords: Natural Language Processing, Retrieval-Augmented Generation, Intent Classification, Semantic Search, Embedding-Based Classification",
    "content": "content/posts/ml130824.md",
    "type": "md"
  },
  {
    "id": "phys140424",
    "title": "What happened to the study of physics?",
    "date": "2024-04-14",
    "tags": ["Physics"],
    "summary": "I am writing about not only the decline of physics but the decline in overall quality and quantity of research. It seems like no undergraduate students are interested in pursuing graduate degrees.",
    "content": "content/posts/phys140424.md",
    "type": "md"
  },
  {
    "id": "misc040424",
    "title": "Research Based Paper For RHET 105",
    "date": "2024-04-04",
    "tags": ["Misc"],
    "summary": "I would have never thought that I would take pride in a paper written for a general education requirement class...",
    "content": "content/posts/misc040424.md",
    "type": "md"
  },
  {
    "id": "phys370",
    "title": "Lecture Notes for PHY 370",
    "date": "2025-02-26",
    "tags": ["School", "Physics", "Quantum"],
    "summary": "These are the notes I take in class.",
    "content": "content/notes/PHYS_370/PHYS370.tex",
    "type": "tex"
  }
]
